[
  {
    "ano": "0",
    "etapa": "EDUCAÇÃO INFANTIL",
    "eixo": "PENSAMENTO COMPUTACIONAL",
    "obj_conhecimento_1": "",
    "obj_conhecimento_2": "",
    "habilidade_superior": "",
    "codigo": "EI03CO01",
    "objetivo_ou_habilidade": "Objetivo de Aprendizagem",
    "descr_objetivo_ou_habilidade": "Reconhecer padrão de repetição em sequência de sons, movimentos, desenhos.",
    "explicacao": "",
    "exemplos": "Computação plugada:\n1) Criar padrões de repetição em sequência com formas e cores diferentes:\n(i) por meio de editor de desenho;\n(ii) por meio de ferramenta online (Pattern Shapes: https://apps.mathlearningcenter.org/pattern-shapes/).\n2) Completar a sequência de figuras de acordo com o padrão estabelecido por meio de jogo online:\n(i) Shape Pattern (https://www.topmarks.co.uk/ordering-and-sequencing/shape-patterns);\n(ii) Chicken Dance (https://pbskids.org/peg/games/chicken-dance).\nComputação desplugada:\n1) Perceber, por meio de tarefas de sua rotina, a repetição de movimentos:\n(i) comer um sanduíche (morder, mastigar, engolir);\n(ii) respirar (inspirar, expirar).\n2) Reconhecer padrão por meio de sons do próprio corpo:\n(i) Perguntar às crianças se sabem o que é um padrão;\n(ii) Escolher uma música produzida com sons do corpo;\n(iii) E, após ouvir, fazer questionamentos como: Alguma coisa nessa música repete? O quê? Qual padrão você conseguiu observar? Você consegue reproduzir?\n3) Criar uma sequência a partir de um padrão de cores ou formas semelhantes, indicando a quantidade de repetições por meio de blocos de montar ou outros materiais"
  },
  {
    "ano": "0",
    "etapa": "EDUCAÇÃO INFANTIL",
    "eixo": "MUNDO DIGITAL",
    "obj_conhecimento_1": "",
    "obj_conhecimento_2": "",
    "habilidade_superior": "",
    "codigo": "EI03CO09",
    "objetivo_ou_habilidade": "Objetivo de Aprendizagem",
    "descr_objetivo_ou_habilidade": "Identificar dispositivos computacionais e as diferentes formas de interação",
    "explicacao": "",
    "exemplos": "Computação Plugada:\n1) Brincar com dispositivos (e.g. tablets, mesas e telas interativas, computador, dispositivos robóticos, tecnologias assistivas) por meio de jogos educacionais ou situações de aprendizagem, a fim de que as crianças possam verificar as diferentes formas de utilização de cada uma delas, como:\n(i) toque de tela em tablets,\n(ii) uso do mouse no computador,\n(iii) manipulação de um robô,\n(iv) comando por voz,\n(v) reconhecimento facial,\n(vi) reconhecimento de gestos.\nComputação Desplugada:\n1) Simular um jogo de perguntas e respostas ou adivinhação usando imagens que representam as diferentes formas de interação entre os dispositivos;\n2) Representar as diferentes formas de interação (e.g. narrativas, storyboards) com dispositivos por meio de atividades manuais (e.g. desenhos, maquetes, colagem, modelagem)."
  },
  {
    "ano": "1",
    "etapa": "ENSINO FUNDAMENTAL - 1º ANO",
    "eixo": "PENSAMENTO COMPUTACIONAL",
    "obj_conhecimento_1": "Organização de objetos",
    "obj_conhecimento_2": "",
    "habilidade_superior": "",
    "codigo": "EF01CO01",
    "objetivo_ou_habilidade": "Habilidade",
    "descr_objetivo_ou_habilidade": "Organizar objetos físicos ou digitais considerando diferentes características para esta organização, explicitando semelhanças (padrões) e diferenças.",
    "explicacao": "Objetos de um mesmo conjunto podem ser organizados e agrupados de diferentes maneiras, enfatizando as características desejadas. A organização adequada pode facilitar a busca por um objeto específico dentro deste conjunto.",
    "exemplos": "O professor pode pedir que os alunos organizem um conjunto de personagens por gênero, cor dos olhos, idade, tamanho, nacionalidade etc. Também pode sugerir que os alunos organizem um conjunto de figuras geométricas por cor, por tipo de figura, por tamanho das figuras etc."
  },
  {
    "ano": "2",
    "etapa": "ENSINO FUNDAMENTAL - 2º ANO",
    "eixo": "PENSAMENTO COMPUTACIONAL",
    "obj_conhecimento_1": "Algoritmos com repetições simples",
    "obj_conhecimento_2": "",
    "habilidade_superior": "",
    "codigo": "EF02CO02",
    "objetivo_ou_habilidade": "Habilidade",
    "descr_objetivo_ou_habilidade": "Criar e simular algoritmos representados em linguagem oral, escrita ou pictográfica, construídos como sequências com repetições simples (iterações definidas) com base em instruções preestabelecidas ou criadas, analisando como a precisão da instrução impacta na execução do algoritmo.",
    "explicacao": "Usar linguagem oral, textual ou pictográfica para descrever algoritmos, percebendo a importância de descrevê-los com precisão para que possam ser executados por outras pessoas (ou máquinas). Os algoritmos aqui devem ser descritos através de sequências de instruções (preestabelecidas ou criadas pelos alunos) que podem ser repetidas um determinado número de vezes. Os ciclos de repetição devem ser simples, isto é, não devem conter outros ciclos.",
    "exemplos": "Os alunos podem construir algoritmos com conjuntos de instruções pré-definidas, como ações para avançar, virar à direita, virar à esquerda, bem como definir seus próprios conjuntos de instruções. Para descrever a tarefa de andar １０ passos, virar a esquerda e andar mais ５ passos, pode-se definir o seguinte algoritmo: 'Ande um passo １０ vezes; vire à esquerda; e ande um passo ５ vezes'."
  },
  {
    "ano": "3",
    "etapa": "ENSINO FUNDAMENTAL - 3º ANO",
    "eixo": "PENSAMENTO COMPUTACIONAL",
    "obj_conhecimento_1": "Lógica computacional",
    "obj_conhecimento_2": "",
    "habilidade_superior": "",
    "codigo": "EF03CO01",
    "objetivo_ou_habilidade": "Habilidade",
    "descr_objetivo_ou_habilidade": "Associar os valores 'verdadeiro' e 'falso' a sentenças lógicas que dizem respeito a situações do dia a dia, fazendo uso de termos que indicam negação.",
    "explicacao": "As sentenças lógicas são sentenças declarativas que representam a constatação de um fato pelo emissor, podendo ser afirmativas ou negativas. Quando se faz uma declaração, ela pode ser \"verdadeira\" ou \"falsa\". Esses termos definem os possíveis valores (verdade) para as sentenças lógicas. Comparações de tamanho, peso ou cor de objetos tem como resultado um valor lógico (\"verdadeiro\" ou \"falso\"). O valor de uma sentença lógica pode ser modificado usando a operação de negação, indicada por termos como NÃO e NÃO É VERDADE QUE.",
    "exemplos": "O professor pode apresentar diferentes sentenças lógicas e solicitar que os alunos determinem seus valores verdade, como por exemplo:\nCinco é maior que seis. (Falso)\nCinco NÃO é maior que seis. (Verdadeiro)\nA raiz é uma das partes de uma planta. (Verdadeiro)\nA raiz NÃO é uma das partes de uma planta. (Falso)"
  },
  {
    "ano": "4",
    "etapa": "ENSINO FUNDAMENTAL - 4º ANO",
    "eixo": "PENSAMENTO COMPUTACIONAL",
    "obj_conhecimento_1": "Matrizes e registros",
    "obj_conhecimento_2": "",
    "habilidade_superior": "",
    "codigo": "EF04CO01",
    "objetivo_ou_habilidade": "Habilidade",
    "descr_objetivo_ou_habilidade": "Reconhecer objetos do mundo real e/ou digital que podem ser representados através de matrizes que estabelecem uma organização na qual cada componente está em uma posição definida por coordenadas, fazendo manipulações simples sobre estas representações.",
    "explicacao": "Informações podem ser organizadas em estruturas, denominadas estruturas de dados. Essas estruturas permitem uma melhor compreensão e também facilitam a manipulação das informações. Uma estrutura de dados esconde a particularidade de diferentes informações, permitindo que sejam vistas como objetos únicos, ou seja, é uma forma de abstração.\nMatrizes são um tipo de estrutura de dados organizadas em linhas e colunas assim como as tabelas. As matrizes possuem um tamanho pré-definido e todos os dados que fazem parte da estrutura são do mesmo tipo. Um dado específico é acessado em uma matriz através de coordenadas (x,y) que indicam a linha e a coluna em que esse se localiza. Matrizes compostas de uma única linha são denominadas vetores. A ideia aqui é que os alunos consigam identificar objetos estruturados no mundo real que possam ser caracterizados como matrizes e usem algum tipo de representação (podendo ser visual) para ilustrá-los. Além disso, devem realizar manipulações simples sobre essas representações como recuperar e alterar informações nas matrizes. Exemplos de objetos que podem ser caracterizados como matrizes: tabuleiro de batalha naval, tabuleiro de xadrez, caixa de ovos, organização de classes em uma sala, janelas na fachada de um prédio etc.",
    "exemplos": "O professor pode solicitar que os alunos construam o tabuleiro (usando uma matriz) e joguem a batalha naval, onde os tiros são dados informando as coordenadas no tabuleiro. Outra atividade que pode ser feita é apresentar diferentes fachadas de prédios e solicitar que os alunos representem a distribuição das janelas por matrizes, registrando nas correspondentes coordenadas as características de cada janela (por exemplo, aberta ou fechada, com cortina ou não, com persiana ou não). Com essas representações, os alunos podem fazer um jogo estilo \"cara a cara\" onde cada jogador escolhe secretamente uma janela (por exemplo ２ª janela do ３º andar) e o adversário deve descobrir a janela escolhida. Para isso, os jogadores devem fazer perguntas, sobre as características das janelas, que permitam ir descartando janelas até descobrir a janela escolhida pelo adversário. O registro das janelas descartadas deve ser feito na matriz que representa a fachada do prédio."
  },
  {
    "ano": "5",
    "etapa": "ENSINO FUNDAMENTAL - 5º ANO",
    "eixo": "PENSAMENTO COMPUTACIONAL",
    "obj_conhecimento_1": "Listas e grafos",
    "obj_conhecimento_2": "",
    "habilidade_superior": "",
    "codigo": "EF05CO02",
    "objetivo_ou_habilidade": "Habilidade",
    "descr_objetivo_ou_habilidade": "Reconhecer objetos do mundo real e digital que podem ser representados através de grafos que estabelecem uma organização com uma quantidade variável de vértices conectados por arestas, fazendo manipulações simples sobre estas representações.",
    "explicacao": "Grafos são um tipo de estrutura usada para representar relações entre objetos. Eles são descritos por vértices (objetos) e arestas (relações). Os grafos também não têm um tamanho pré-definido, o que permite a resolução de problemas que tratam argumentos de diferentes tamanhos (Um algoritmo que encontra um caminho em um mapa pode ter como entrada tanto um mapa de uma região como um mapa de um país.). A ideia aqui é que os alunos consigam identificar objetos estruturados no mundo real que possam ser caracterizados como grafos e usem algum tipo de representação (podendo ser visual) para ilustrá-los. Além disso, devem realizar manipulações simples sobre essas representações como recuperar informações ou encontrar caminhos nos grafos. Exemplos de objetos que podem ser representados usando grafos: mapas, redes sociais, internet, redes de computadores, árvores genealógicas, chaveamento de times em um campeonato etc.",
    "exemplos": "O professor pode distribuir, para diferentes grupos os alunos, mapas do bairro onde alguns prédios estão marcados. Pedir que eles tracem linhas ligando esses prédios sempre que houver um caminho entre eles sem passar na frente de outro (dentre os marcados). Marcar na linha traçada o número de quadras de cada caminho considerado. Pedir que os grupos comparem seus grafos para verificar se todos tem as mesmas arestas ou não e qual o número de quadras dos caminhos encontrados. Depois pode-se construir conjuntamente a representação do grafo, considerando os menores caminhos encontrados dentre os resultados de cada grupo. Com a representação única pedir que tracem rotas passando por determinados prédios, calculando o número de quadras que se deve andar para chegar no destino. Voltar ao mapa e traçar as rotas identificadas no grafo, nas ruas do bairro.\nO professor pode distribuir os perfis fictícios de diferentes pessoas em alguma rede social, indicando amigos comuns entre os donos dos perfis. Pedir que representem a relação de amizade através de um grafo, no qual as pessoas são representadas por vértices e a amizade pelas arestas. Depois fazer perguntas sobre amigos comuns, \"distância\" de amizades etc."
  },
  {
    "ano": "7",
    "etapa": "ENSINO FUNDAMENTAL - 7º ANO",
    "eixo": "PENSAMENTO COMPUTACIONAL",
    "obj_conhecimento_1": "Programação",
    "obj_conhecimento_2": "Programação usando registros e matrizes",
    "habilidade_superior": "Construir e analisar soluções computacionais de problemas de diferentes áreas do conhecimento, de forma individual ou colaborativa, selecionando as estruturas de dados adequadas (registros, matrizes, listas e grafos), aperfeiçoando e articulando saberes escolares.",
    "codigo": "EF07CO01",
    "objetivo_ou_habilidade": "Habilidade",
    "descr_objetivo_ou_habilidade": "Criar soluções de problemas para os quais seja adequado o uso de registros e matrizes unidimensionais para descrever suas informações e automatizá-las usando uma linguagem de programação.",
    "explicacao": "Para automatizar a solução de um problema através da construção de um programa de computador, normalmente é necessário definir as estruturas de dados que serão usadas para representar a informação relacionada ao problema, e depois descrever o algoritmo usando as construções disponíveis na linguagem de programação escolhida. Uma das estruturas mais usadas é o registro, que permite descrever objetos identificando atributos destes objetos, permitindo assim que se trabalhe em um nível de abstração maior: ao invés de receber vários dados de um aluno separados, um programa pode receber o 'registro' de um aluno ( que seria um dado que engloba as várias informações sobre um aluno).\nMatrizes unidimensionais (ou vetores) podem ser usados quando temos situações nas quais queremos representar que um determinado objeto é composto por vários elementos similares, por exemplo, uma turma pode ter vários alunos; um tabuleiro de xadrez pode ter várias peças, um armário possui várias gavetas etc. A ideia é que cada elemento em uma matriz/vetor ocupa uma posição. Matrizes podem ter uma ou mais dimensões.",
    "exemplos": "Desenvolver um programa que leia os dados de um documento de identidade, calcule a idade e mostre todas as informações na tela. Ou um programa que armazene um cadastro de grupos de pessoas com os seguintes dados: nome, telefone e data de nascimento (dia, mês, ano) e realize consultas (como pessoas que fazem aniversário em um determinado mês).\n\nDesenvolver um programa que lê os cartões de resposta do vestibular e um gabarito, verificando para cada candidato o seu número de acertos."
  },
  {
    "ano": "8",
    "etapa": "ENSINO FUNDAMENTAL - 8º ANO",
    "eixo": "PENSAMENTO COMPUTACIONAL",
    "obj_conhecimento_1": "Programação",
    "obj_conhecimento_2": "Programação com listas e recursão",
    "habilidade_superior": "Construir e analisar soluções computacionais de problemas de diferentes áreas do conhecimento, de forma individual ou colaborativa, selecionando as estruturas de dados adequadas (registros, matrizes, listas e grafos), aperfeiçoando e articulando saberes escolares.",
    "codigo": "EF08CO01",
    "objetivo_ou_habilidade": "Habilidade",
    "descr_objetivo_ou_habilidade": "Construir soluções de problemas usando a técnica de recursão e automatizar tais soluções usando uma linguagem de programação.",
    "explicacao": "O conceito de recursão permite exercitar o pensamento indutivo na resolução de problemas, ou seja, recursão não deve ser entendida como uma questão sintática e sim como uma forma poderosa de resolver problemas. O raciocínio indutivo é muito útil na resolução de problemas, pois permite que se trabalhe em um nível de abstração mais elevado do que usando raciocínio dedutivo, o que em muitas situações facilita encontrar soluções (grande parte dos algoritmos clássicos da Computação são bem mais fáceis de compreender nas suas versões recursivas).",
    "exemplos": "(1) Solução recursiva para definir o tamanho de uma lista: \"se a lista for vazia, o tamanho é zero, senão o tamanho é um mais o tamanho do resto da lista.\" (2) Solução recursiva para encontrar o número de ascendentes de olhos azuis em uma árvore genealógica: Se a árvore estiver vazia, o resultado é zero, senão se a pessoa da raiz da árvore tiver olhos azuis, soma １ ao número de ascendentes de olhos azuis por parte de pai e de mãe desta pessoa, se ela não tiver olhos azuis, o resultado é o número de ascendentes de olhos azuis (por parte de pai e mãe) desta pessoa."
  },
  {
    "ano": "9",
    "etapa": "ENSINO FUNDAMENTAL - 9º ANO",
    "eixo": "PENSAMENTO COMPUTACIONAL",
    "obj_conhecimento_1": "Programação",
    "obj_conhecimento_2": "Programação usando grafos e árvores",
    "habilidade_superior": "Construir e analisar soluções computacionais de problemas de diferentes áreas do conhecimento, de forma individual ou colaborativa, selecionando as estruturas de dados adequadas (registros, matrizes, listas e grafos), aperfeiçoando e articulando saberes escolares.",
    "codigo": "EF09CO01",
    "objetivo_ou_habilidade": "Habilidade",
    "descr_objetivo_ou_habilidade": "Criar soluções de problemas para os quais seja adequado o uso de árvores e grafos para descrever suas informações e automatizá-las usando uma linguagem de programação.",
    "explicacao": "Grafos e árvores podem ser usados para representar uma gama enorme de informações. Para que possamos construir programas de computador, essas estruturas precisam ser formalizadas e descritas em linguagens de programação. Grafos são estruturas que permitem representar objetos e relacionamentos entre esses objetos (como redes sociais, mapas de cidades, a internet etc.). Uma árvore é um grafo com elementos organizados hierarquicamente. Exemplos de árvores são árvores genealógicas, organogramas, mapas mentais, chaveamento de times etc",
    "exemplos": "Construir um algoritmo para encontrar um caminho em um mapa (grafo), partindo de uma cidade e chegando em outra. Ou então, construir um algoritmo para encontrar os filhos de uma pessoa numa árvore genealógica."
  },
  {
    "ano": "69",
    "etapa": "ETAPA - 6º ao 9º ANO",
    "eixo": "PENSAMENTO COMPUTACIONAL",
    "obj_conhecimento_1": "Programação",
    "obj_conhecimento_2": "Tipos de dados",
    "habilidade_superior": "Construir e analisar soluções computacionais de problemas de diferentes áreas do conhecimento, de forma individual ou colaborativa, selecionando as estruturas de dados adequadas (registros, matrizes, listas e grafos), aperfeiçoando e articulando saberes escolares.",
    "codigo": "EF69CO01",
    "objetivo_ou_habilidade": "Habilidade",
    "descr_objetivo_ou_habilidade": "Classificar informações, agrupando-as em coleções (conjuntos) e associando cada coleção a um ‘tipo de dado’.",
    "explicacao": "Para encontrar uma carta do tipo Ás em um baralho, precisa-se de um baralho (lista de cartas) e, o resultado é uma carta; para calcular a média das provas dos alunos de uma turma, precisa-se da lista de provas dos alunos, e o resultado é um número.",
    "exemplos": "Para encontrar uma carta do tipo Ás em um baralho, precisa-se de um baralho (lista de cartas) e, o resultado é uma carta; para calcular a média das provas dos alunos de uma turma, precisa-se da lista de provas dos alunos, e o resultado é um número"
  },
  {
    "ano": "69",
    "etapa": "ETAPA - 6º ao 9º ANO",
    "eixo": "CULTURA DIGITAL",
    "obj_conhecimento_1": "Uso de tecnologias computacionais",
    "obj_conhecimento_2": "Tecnologia digital e sustentabilidade",
    "habilidade_superior": "Selecionar e utilizar tecnologias computacionais para se expressar e resolver problemas, analisando criticamente os diferentes impactos na sociedade.",
    "codigo": "EF69CO12",
    "objetivo_ou_habilidade": "Habilidade",
    "descr_objetivo_ou_habilidade": "Analisar o consumo de tecnologia na sociedade, compreendendo criticamente o caminho da produção dos recursos bem como aspectos ligados à obsolescência e a sustentabilidade.",
    "explicacao": "Importante aqui o aluno identificar e refletir sobre o caminho e impactos em que a produção da tecnologia tem em nossa sociedade. Assim, espera-se que o aluno reconheça a cadeia de produção da tecnologia, seus usos no cotidiano do ser humano e os impactos no meio ambiente.",
    "exemplos": "O professor poderá elaborar um jogo que demonstre os caminhos da tecnologia, sua produção e seu descarte, considerando tomadas de decisão pelo aluno do que fazer durante o jogo."
  }
]